package lab3_1;

/*
Създайте  програма,  подпомагаща  дейността  на  туристическа  фирма.  Фирмата организира 2 вида пътувания–екскурзиии почивки.
Почивката е пътуване до даден курорт,  в  който  цяла  ваканция  се  изкарва  в  един  хотел,
а  времето  сеизползва според индивидуалните желания, а екскурзията е организирано пътуване,
чиято цел е да се посетят различни места и туристически обекти и затова често нощувките са на  различни  места.
Особеност  на  компанията  е,  че –в  зависимост  от  вида  на пътуванетоизползва 2 вида транспорт –автобусен за екскурзиите и самолетен за почивките.
1.Създайте клас Пътешествие, съдържащ: дестинация, бройдниицена. Да се реализиратконструкторс  параметри иподходящи get()  и  set() методи.
В предварително обявената цена не се включва транспорта. Класът трябва да съдържа абстрактнияметод fixPrice(price),
при  предефинирането  на  който трябва да сеизчислява крайнатаценавсяко пътуване.
2.Дефинирайте клас Екскурзия, който наследява класа Пътешествие.
Класът Екскурзия  трябва  да  съдържа  данни  за брояна  хотелите.Да  се  реализират конструктор  с  параметри  и  подходящи  get()  и set() методи.
Автобусният транспорт,  който  компанията  използва  при  екскурзии,  оскъпява  крайната цена с 10 процента.
3.Напишете  клас Почивки,наследяващ класа Пътешествие.Класът  Почивки трябва  да  съдържа  информация  за  името  на  хотела,
в който ще бъдат настанени клиентите. Да се реализират конструктор с параметри и подходящи get()  и  set()  методи.
Самолетният  транспорт,който  компанията  използваувеличава крайната цена с 40 на сто.
4.Пътуването  с  автобус  обикновено  трае  около  24  часа  в  едната  посока. Създайте  интерфейс Брой  нощувки, който съдържа  абстрактен  метод,
определящ  броя  нощувки  при  подаден  брой  дни  на  екскурзията.  Нека  този интерфейс да се имплементира от класа Екскурзия.
5.Създайте  тестов  клас,  съдържащ main()метод,  в  който  да  демонстрирате работоспособността на програмата.
 */


public class Demo {
    public static void main(String[] args) {

        Holidays holidays = new Holidays("Bulgaria",3,400,"Afrodita");
        Trip trip = new Trip("Macedonia", 4,300,2);


        trip.countNights(5);
        holidays.fixPrice();
        System.out.println(holidays.getPrice());

    }
}
